Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Analysis.VectorAtPoint})
Creates object from an array of domain point vectors
vectorAtPoint:
Array of vectors, each corresponding to a domain point
Throws Autodesk.Revit.Exceptions.ArgumentException:
Members of vectorAtPoint contain different numbers of measurements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Analysis.ValueAtPoint},Autodesk.Revit.DB.XYZ)
Creates object from an array of domain point values
valueAtPoint:
Array of values, each corresponding to a domain point
unitDirection:
Unit vector that gives the same direction for values (for diagrams)
Throws Autodesk.Revit.Exceptions.ArgumentException:
Members of valueAtPoint contain different numbers of measurements
-or-
unitDirection is not a unit vector
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.FieldValues.#ctor(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Analysis.ValueAtPoint})
Creates object from an array of domain point values
valueAtPoint:
Array of values, each corresponding to a domain point
Throws Autodesk.Revit.Exceptions.ArgumentException:
valueAtPoint array contains members with different numbers of measurements
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011